---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.Insert(Autodesk.Revit.DB.SlabShapeCrease,System.Int32)
source: html/8e7a815a-1d62-3774-220b-cbda8ba0afc5.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.Insert Method

Insert the specified item into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	SlabShapeCrease item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.SlabShapeCrease`) - The item to be inserted into the array.
- **index** (`System.Int32`) - The item will be inserted before this index.

## Returns
Returns whether the item was inserted into the array.